#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>
#include <locale.h>
#include <math.h>


#define LCL      35.00   /* нижняя граница контроля */
#define X_MIN     0.0    /* минимальное показание датчика */
#define X_MAX    21.0    /* максимальное показание датчика */

int main(void)
{
    setlocale(LC_ALL, ".UTF8");

    double x;        /* показание датчика */
    double q;        /* индикатор процесса */
    int    state;    /* 0 - НОРМА, 1 - ТРЕВОГА, 2 - ОШИБКА */
    int    i;        /* счётчик цикла */


    printf("Добро пожаловать в ректор!! Вы попали в систему мониторинга уровня кислорода.\n\n");
    printf("Определение уровня расчитывается по трем динамичным формулам. \n\n");
    printf("Этап 1. Расчет Q = f(X), контроль по LCL = %.2f \n\n", LCL);
    printf("В данном этапе: Q - преобразованное значение параметра кислорода, Х - параметр кислорода, измеряемый в процентах.\n\n");
    printf("Если при преобразование уровня кислорода его значение ниже LCL, то в системе приходит оповещение о тревоге \n\n");
    printf("Допустимый диапозон Х: от 0 до 21\n\n");
    printf("*********************************************************************************************************************\n\n");

    /* обрабатываем 5 значений (потом заменю на чтение из файла, когда изучим) */
    for (i = 1; i <= 5; i = i + 1)
    {
        printf("Введите X  (значение %d из 5): ", i);
        scanf("%lf", &x);

        /* проверка диапазона */
        if (x < X_MIN || x > X_MAX)
        {
            printf("Ошибка: X вне диапазона %.1f...%.1f\n\n", X_MIN, X_MAX);
            continue;
        }

        /* преобразование Q = f(X) по формуле */
        if (x < 2.0)
        {
            if (x <= 0.0)
            {
                printf("Ошибка: при X <= 0 логарифм не определен\n\n");
                continue;
            }
            q = 4.0 * log(x) + 15.0;
        }
        else if (x <= 8.0)
        {
            q = (x - 5.0) * (x - 5.0) + 45.0;
        }
        else
        {
            q = 2.0 * (x - 8.0) + 60.0;
        }



        /* контроль по нижней границе */
        if (q < LCL)
        {
            state = 1;   /* ТРЕВОГА */
        }
        else
        {
            state = 0;   /* НОРМА */
        }

        /* вывод результата */
        printf("X = %.2f   Q = %.2f   Состояние: ", x, q);
        switch (state)
        {
        case 0:
            printf("НОРМА\n\n");
            break;
        case 1:
            printf("ТРЕВОГА\n\n");
            break;
        default:
            printf("НЕИЗВЕСТНО\n\n");
            break;
        }
    }

    printf("Состояние программы: завершена\n");
    return 0;
}